[
  {
    "path": "posts/2021-06-20-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": {},
    "author": [
      {
        "name": "Ahmad Fady Ganis",
        "url": {}
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\n\r\nIntroduction\r\n\r\n\r\n\r\nFor this makeover, the task at hand is to critique a bubble chart which represents the total trade happening between Singapore and 10 of its trading partners between 2011-2020\r\n\r\n\r\nThe steps taken is to first identify what was done wrong in the given visualization, sketch the plan on how to improve it, and then create the improvement using Tableau Desktop.\r\n\r\n\r\nCritique of Visualization\r\n\r\n\r\n\r\nFor this makeover, the original visualization can be seen below.\r\n\r\n\r\n\r\n\r\nFigure 1: original visualization\r\n\r\n\r\n\r\n\r\nThe bubble chart above shows a relationship of 3 variables between Singapore and some of its trading partners which are the total import shown in the y-axis, the total export shown in the x-axis, and the total merchandise trade represented by the size of each bubble. In addition, the placement of the center of each bubble shows whether the relationship between Singapore and that partner is if Singapore is a net importer, net exporter or is balanced with that specific partner.\r\n\r\n\r\nLooking initially at the graph, some critiques can be given based on its clarity and aesthetic which will be discussed further in this section.\r\n\r\n\r\nClarity\r\n\r\n\r\nMissing graph title makes readers hard to instantly understand what the bubble chart shows.\r\nNo specific explanation as to what the label next to each bubble is, further contemplation with relation to the size of bubble mentioned in a small note results in the conclusion that the label shows the total trade (export + import).\r\nNo clarification as to by how much Singapore has a surplus (if net exporter) or deficit (if net importer) with its trading partners.\r\n\r\nAesthetic\r\n\r\n\r\nToo many partners clumped together makes it hard to see the exact placement of bubbles.\r\nUsing colour code to label trade partners makes it unintuitive\r\nBubbles covered by annotations of a partner next to it makes it difficult to see if that bubble is in a net importer or net exporter region.\r\nBlue and green background to show a trade surplus or deficit is not ideal since both colors generally represent a positive tone.\r\n\r\nMakeover Proposal Sketch\r\n\r\n\r\nBased on the issues identified in the previous section, an improved visualization can be developed that addresses the listed problems. A sketch of the graph model can be seen in the figure below.\r\n\r\n\r\n\r\n\r\nFigure 2: sketch of improvement\r\n\r\n\r\n\r\n\r\nClarity\r\n\r\n\r\nAdded title to clearly convey what the chart is aiming to inform.\r\nAnnotations turned into tooltips to not take up space when information not needed.\r\nTrade balance added as info to tooltip.\r\n\r\n\r\nAesthetics\r\n\r\n\r\nSize of bubble and axes adjusted to avoid too much parts clumped together\r\nBubble uses flags of each partner instead for more instantaneous recognizition by readers.\r\nannotations changed to tooltips\r\nRegion color changed to orange (for net import) and green (for net export) for a more intuitive color code of having a negative or positive trade balance.\r\n\r\nProposed Visualization\r\n\r\n\r\n\r\n\r\nFigure 3: sketch of improvement\r\n\r\n\r\n\r\n\r\nAbove is a static image of the visualization improvement. An interactive version can be seen in Tableau Public Here.\r\n\r\n\r\nSteps Documentation\r\n\r\n\r\nData Preparation\r\n\r\nBefore any visualizations can be made, some data preparations must first be conducted using Tableau Desktop. The steps taken include:\r\n\r\nImport the dataset to Tableau. Click on the “Microsoft excel” option in the connect data pane.\r\n\r\n\r\n\r\nFigure 4: import excel file.\r\n\r\n\r\n\r\nSelect the dataset file.\r\n\r\n\r\n\r\nFigure 5: import excel file.\r\n\r\n\r\n\r\nDrag “New Union” to the data prep sheet and select the T1 and T2 sheets.\r\n\r\n\r\n\r\nFigure 6: union of the 2 worksheets\r\n\r\n\r\n\r\nOn the left side of the screen, tick the “Data Interpreter” to skip the rows containing the title of the sheet.\r\n\r\n\r\n\r\nFigure 7: enable ‘Data Interpreter’\r\n\r\n\r\n\r\nIn the top right side, click on the “filters”, then “Add..”, then “variables” and select the 10 trading partners that will be visualized.\r\n\r\n\r\n\r\nFigure 8: filter the used trade partners\r\n\r\n\r\n\r\nOn the fields that are not the years used (ie. not between 2011-2020), highlight all of them and right click then click hide.\r\n\r\n\r\n\r\nFigure 9: hide months outside of used range\r\n\r\n\r\n\r\nHighlight all columns except for “Variables”, “Sheet” and “Table Name” fields, then right click one of the highlighted column and click on “Pivot”.\r\n\r\n\r\n\r\nFigure 10: pivot the month fields\r\n\r\n\r\n\r\nThe “Import” and “Export” fields are still combined and must first be separated. First create the “Import” Field using this calculation.\r\n\r\n\r\n\r\nFigure 11: import calculation\r\n\r\n\r\n\r\nThe “Export” field uses a similar calculation.\r\n\r\n\r\n\r\nFigure 12: export calculation\r\n\r\n\r\n\r\nIn the “Variables” field, click on “create calculated field” with the shown formula to remove the “(Thousands Dollar)” or “(Million Dollar)” part of the name.\r\n\r\n\r\n\r\nFigure 13: clean the trade partner name\r\n\r\n\r\n\r\nCreate a “Merchandise Trade” field by adding “Import” and “Export”.\r\n\r\n\r\n\r\nFigure 14: create merchandise trade field\r\n\r\n\r\n\r\n\r\nBackground Creation\r\n\r\n\r\nFor this graph, the background will be divided into 2 regions, net importer and net exporter. Therefore, a background with such a color scheme will be first created to be loaded into the visualization as a background image. The steps are listed as follow.\r\n\r\nCreate an excel file with the fields “position”, “import” , “export” and “stat”. Position refers to points of angle in which this case the background will be divided into 2 triangles, hence 3 positions for each status. The import and export would be the maximum and minimum value in each corresponding axes.\r\n\r\n\r\n\r\nFigure 15: created excel file\r\n\r\n\r\n\r\nImport the file into Tableau.\r\n\r\n\r\n\r\nFigure 16: file selected to import\r\n\r\n\r\n\r\nDrag the fields into the appropriate axes.\r\n\r\n\r\n\r\nFigure 17: fields dragged to row and column\r\n\r\n\r\n\r\nDrag the “stat” field into the “color” mark.\r\n\r\n\r\n\r\nFigure 18: stat field added to mark\r\n\r\n\r\n\r\nIn the “Analysis” pane, un-tick the “Aggregate Measures” option.\r\n\r\n\r\n\r\nFigure 19: disable the ‘Aggregate Measures’\r\n\r\n\r\n\r\nChange the mark type from “Automatic” to “Polygon” and drag the “Stat” field into “Path”.\r\n\r\n\r\n\r\nFigure 20: background created\r\n\r\n\r\n\r\nExport the chart as a .png extension with only “view” ticked.\r\n\r\n\r\n\r\nFigure 21: file export settings\r\n\r\n\r\n\r\n\r\nFlag Icons Creation\r\n\r\n\r\nOn top of backgrounds, the bubble of each trading partner will also feature its flag. Therefore, custom shapes must also be created using Microsoft word and images of the flags found online. The steps are done as follow.\r\n\r\nIn Microsoft Word, create a circle shape\r\n\r\n\r\n\r\nFigure 22: circle shape\r\n\r\n\r\n\r\nRight click the object then select “Fill” and then click on “Picture”\r\n\r\n\r\n\r\nFigure 23: fill circle with picture\r\n\r\n\r\n\r\nSelect the image file\r\n\r\n\r\n\r\nFigure 24: image file selected\r\n\r\n\r\n\r\nRight click on the object select “Format Shape” and set the placement and sharpness until the image fits the circle and looks good.\r\n\r\n\r\n\r\nFigure 25: fixed image proportions\r\n\r\n\r\n\r\nRight click the object and select “Save as Picture”\r\n\r\n\r\n\r\nFigure 26: save object as image\r\n\r\n\r\n\r\nChoose the directory My Documents > My Tableau Repository > Shapes then create a new folder and save the image on that new folder\r\n\r\n\r\n\r\nFigure 27: file save path\r\n\r\n\r\n\r\nRepeat the steps for all flags needed\r\n\r\n\r\n\r\nFigure 28: flag icons for all partners\r\n\r\n\r\n\r\n\r\nChart Creation\r\n\r\n\r\nWith the data fully cleaned and connected as well as the background region and flag icons created. The chart can then be created with the following steps.\r\n\r\n\r\nDrag the “Export” and “Import” fields to the “Columns” and “Rows” section, respectively.\r\n\r\n\r\n\r\nFigure 29: placement of fields\r\n\r\n\r\n\r\nDrag the “Trade Partner” field to the “Shape” mark.\r\n\r\n\r\n\r\nFigure 30: trade partners dragged to shape mark\r\n\r\n\r\n\r\nLeft click on shape, select the custom-made shape palette and assign each flag to its corresponding partner\r\n\r\n\r\n\r\nFigure 31: assignment of flags\r\n\r\n\r\n\r\nDrag the “Merchandise Trade” field to the size mark and adjust the slider to a proper level.\r\n\r\n\r\n\r\nFigure 32: adjustment of size\r\n\r\n\r\n\r\nTo add the background image, first go to Map > Background Images > Union.\r\n\r\n\r\n\r\nFigure 33: add background image path\r\n\r\n\r\n\r\nIn the “add image” section, browse for the exported background and set the max value in the x-axis and y-axis to 750B.\r\n\r\n\r\n\r\nFigure 34: add background image\r\n\r\n\r\n\r\nOn the x and y axes, set the limit to 700B.\r\n\r\n\r\n\r\nFigure 35: set axis range\r\n\r\n\r\n\r\nAdd Area Annotations to mark the regions for “Net Importer” and “Net Exporter”\r\n\r\n\r\n\r\nFigure 36: region annotations added\r\n\r\n\r\n\r\nIn the “Trade Partner” field, select create > group\r\n\r\n\r\n\r\nFigure 37: create new group\r\n\r\n\r\n\r\nCreate groups by CTRL click the partners then press group and name the group based on the regions. Also tick the “Include Other” box to group USA and EU.\r\n\r\n\r\n\r\nFigure 38: group partners by region\r\n\r\n\r\n\r\nRename the group to “Region” then drag the group and the “Trade Partner” field to filters.\r\n\r\n\r\n\r\nFigure 39: group renamed and added to filters\r\n\r\n\r\n\r\nIn the “Export” field, right click and select create calculated field with the following formula\r\n\r\n\r\n\r\nFigure 40: trade balance calculation\r\n\r\n\r\n\r\nDrag the newly created field to “Tooltip” mark\r\n\r\n\r\n\r\nFigure 41: trade balance added to tooltip\r\n\r\n\r\n\r\nFormat the placement of the tooltips to create an even lining with each other.\r\n\r\n\r\n\r\nFigure 42: format placement of tooltips\r\n\r\n\r\n\r\nRename the title of the chart\r\n\r\n\r\n\r\nFigure 43: title properly renamed\r\n\r\n\r\n\r\nAdd another annotation for the source of data\r\n\r\n\r\n\r\nFigure 44: source added\r\n\r\n\r\n\r\n\r\nGenerated Insights\r\n\r\nFrom the chart created, useful information about Singapore’s trade can be inferred. Some of the more interesting findings are listed below.\r\nIn general, Singapore has net import trade relationships with developed countries (Japan, USA, EU, Korea) while having net export trade relationships with developing countries (Indonesia, Malaysia, Thailand).\r\nIn relation to the “Gravity Model of Trade”, which states an entity will trade more in relative to a partner’s size and proximity. Singapore’s biggest trade partners are geographically farther (e.g., EU, USA, China) while it trades less with nearer countries (i.e., Indonesia and Thailand), making it seem that Singapore leans more to the economic size of a partner than the proximity. Malaysia, which is Singapore’s nearest neighbor country is the only exception.\r\nSingapore’s imports primarily include machinery and equipment, mineral fuels, chemicals, food and consumer goods ASEAN Briefing. This would explain why regions abundant in natural resources (e.g., USA, Malaysia, China, EU) would have higher import trades happening, albeit not necessarily making Singapore a net importer to them, while regions with little natural resources such as Thailand and Hong Kong have a much lower import value compared to how much Singapore exports to them.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-06-20-dataviz-makeover-2/orisketch/ori.jpg",
    "last_modified": "2021-06-24T18:52:32+08:00",
    "input_file": "dataviz-makeover-2.knit.md"
  },
  {
    "path": "posts/2021-05-29-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "Given a graph, this article will cover the critiques concerning said graphs, plans on how to improve visualization, and steps to create the sketched improvement using Tableau Desktop.",
    "author": [
      {
        "name": "Ahmad Fady Ganis",
        "url": {}
      }
    ],
    "date": "2021-05-29",
    "categories": [],
    "contents": "\r\n\r\nCritique of Visualization\r\n\r\n\r\n\r\nFor this makeover, the original visualization can be seen below.\r\n\r\n\r\n\r\nClarity\r\n\r\n\r\nThe title of the visualization does not clearly convey what kind of information it is trying to give. While it is true the graph represents merchandise trade, it does not state which country is trading with those six countries. Furthermore, no explanation on what currency is used as its unit leaves the numbers meaningless to the readers.\r\nIn addition, the y-axes are in the millions while looking at the data the values are in billions. Thereby revealing that the visualization fails to mention that the values are divided by 1 thousand anywhere in the title.\r\nThe x-axis says “month of period” which would imply the dataset is a monthly time series. However, the values used in that axis is instead the years with no specific starting and ending months.\r\nLow data ink ratio from the area chart makes it hard for readers to infer what the chart is trying to inform.\r\n5 of the 6 countries visualized has the same range of export and import values (millions). However, the ticks of the y-axes are not in the same height which may lead to readers falsely assuming that export and import at a certain time are equal while the reality is far from it. In addition, the difference in height between the countries would make it hard for readers to see which countries are trading more than the others (e.g. the graph would imply that Japan and China are equal trading partners to Singapore based on the graph height. However, looking at the numbers the 2 countries have a difference of over 4 billion SGD in monthly merchandise trading).\r\nNo source of data gives the graph less credibility to the readers.\r\nNo annotations to further communicate what the graph is trying to explain to the readers.\r\n\r\nAesthetics\r\n\r\n\r\nChoice of words in graph title using “merchandise trade” makes it harder for the average reader to understand.\r\nThe choice to fill the graph color all the way down to the x-axis makes it hard for readers to see the values especially when the Import graph is higher than the Export graph.\r\nUsing dual axis on the same magnitude and unit makes it redundant.\r\nNo tick marks on the x-axis despite being a continuous data.\r\nTitle of the y-axes are placed vertically, making It hard for viewers to read.\r\nPlacement of legend at the far right makes readers hard to continually identify which color represent each dataset.\r\n\r\nMakeover Proposal Sketch\r\n\r\n\r\nBased on the issues identified in the previous section, an improved visualization can be developed that addresses the listed problems. A sketch of the graph model can be seen in the figure below.\r\n\r\n\r\n\r\nClarity\r\n\r\n\r\nThe title has been changed to reflect the data presented. The graph shows the trades happening between Singapore and its top 6 trading countries. In addition, the unit of numbers are also added to give clarity on what currency is used for the data.\r\nThe y-axis range has been changed to Billions as is the real dataset is to eliminate confusion of the true value of trades happening.\r\nTick marks in x-axis changed from yearly to monthly.\r\nHigh data ink ratio from eliminating the area makes it easy for readers to infer the values.\r\nLabel height for both y-axes have been standardized to 0-8 billion SGD. This is done such that not only the export and import values of one graph can be more easily distinguished, but the values from one country graph to another can also be immediately compared without consulting the labels for each country graph.\r\nThe source of data which is Singapore government’s Department of Statistics is added to give credibility to the visualization.\r\nAnnotations are added to any points of interest found to give a deeper understanding to the readers.\r\nOrder of appearance sorted based on magnitude for ease of comparison\r\n\r\n\r\nAesthetics\r\n\r\n\r\n“Merchandise trade” has been changed to “Export and Import of Goods”. While “Merchandise Trade” is the correct terminology used by WTO, “Export and Import of Goods” is also a correct term which has the same meaning and is also more widely understood by the average readers.\r\nThe line graph is not filled to the bottom to make the graphs easier to read.\r\nOnly 1 axis is used considering both exports and imports are in the billions SGD magnitude and unit to eliminate redundancy.\r\nTick marks added to the x-axis in accordance with added labels discussed in the Clarity sub-section.\r\nTitles of the y-axes are rotated to horizontal for ease of reading.\r\nThe legends are incorporated into the dashboard title to give readers a faster way to reference the colors while also adding aesthetic features to the title.\r\n\r\nProposed Visualization\r\n\r\n\r\nThe proposed visualization improvement can be seen in Tableau Public Here.\r\n\r\n\r\nSteps Documentation\r\n\r\n\r\nData Preparation\r\n\r\n\r\nBefore any visualizations can be made, some data preparations must first be conducted using Tableau Desktop. The steps taken include:\r\n\r\n\r\nImport the dataset to Tableau. Click on the “Microsoft excel” option in the connect data pane.\r\n\r\nSelect the dataset file.\r\n\r\nDrag the T1 sheet to the “drag tables here” part of the screen.\r\n\r\nOn the left side of the screen, tick the “data interpreter” to skip the rows containing the title of the sheet.\r\n\r\nIn the top right side, click on the “filters”, then “Add..”, then “variables” and select the 6 countries that will be visualized.\r\n\r\nOn the fields that are not the years used, highlight all of them and right click then click hide.\r\n\r\nHighlight all columns except for “Variables”, right click one of the highlighted column and click on pivot.\r\n\r\nRename the pivoted fields.\r\n\r\nChange the type of “Month” field from “string” to “date”.\r\n\r\nIn the Import field, click “Create Calculated Field” and set code to multiply by 1000 to eliminate (in thousands) clarifier\r\n\r\nIn the “Variables” field, click on “create calculated field” with the shown formula to remove the “(Thousands Dollar)” part of the country.\r\n\r\nIn the “worksheet” window, select “Data” menu, then “New Data Source” select the dataset and repeat the steps for the T2 sheet.\r\n\r\nGo to “Data” menu, then click on “Edit Blend Relationships” to check if both data sources have been matched in the “Month” and “Variables” fields and then click “OK”.\r\n\r\nMake sure the data is linked in “Country” and “Month”, the data is linked if the icon is red\r\n\r\n\r\n\r\nGraph Creation\r\n\r\n\r\nWith the data fully cleaned and connected, the graphs can then be created with the following steps.\r\n\r\n\r\nDrag “Country” and “Month” fields to columns pane and “Export” and “Import” to rows pane. Then on the right axis, right click and choose “Synchronize Axis” and deselect “Show Header”. Then set month format to “Month/Year” and fit the graph by width.\r\n\r\nEdit Axis” the left axis and delete the title\r\n\r\nIn the “Rows” section, double click and type “Merchandise Trade (S$)”\r\n\r\nRight click on the top part of “Merchandise Trade (S$)” and “Country/Month” and click “Hide Field Labels for Rows” and “Hide Field Labels for Columns”, respectively.\r\n\r\nDashboard Creation\r\n\r\nWith the visualization created, the dashboard can be built by clicking the “New Dashboard” button.\r\nIn a new dashboard, drag text object to the dashboard and type the title\r\n\r\nDrag another text object below the title to provide space for commentary later\r\n\r\nDrag the worksheet below the commentary box and adjust the proportion between the 3 objects\r\n\r\nWhen creating annotations, right click the box and select “Format”, change the shading to a low percentage to allow y-axis label marks to be seen and select a line color that is visible\r\n\r\nWrite annotations and comment, as well as drag the graphs around to sort by magnitude\r\n\r\nDrag text object at bottom of dashboard and add source of data\r\n\r\n\r\nGenerated Insights\r\n\r\n\r\nA sharp jump in exports from February 2020 to April 2020 for 3 of the 6 countries (Mainland China, United States, and Hong Kong) as well as a slight rise for another 2 (Japan and Taiwan) may be in most parts due to a high influx of demand for pharmaceuticals and medical supplies caused by Covid-19. StraitsTimes\r\nIn January – April 2020, Malaysia experiences a sharp decline in export and import with Singapore due to shutdown of its many key economic sectors due to the pandemic, creating the worst slump in trade for the constitutional monarchy since the 2008 financial crisis. TheEdgeMarkets , Malaysia Department of Statistics\r\nWith china starting to recover by late 2020, August 2020 saw the largest export to china mostly in non-oil products due to rising demands, a 104% increase from January 2020. BloombergQuint\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-05-29-dataviz-makeover-1/orisketch/ori.png",
    "last_modified": "2021-06-20T12:44:58+08:00",
    "input_file": {}
  }
]
